[
    {
      "cluster_id": 1,
      "detected_category": "Exporting & Trade Access",
      "article_count": 22,
      "key_headlines": [
        "IWS Logistics Boosts Efficiency and Sustainability with KALMAR DCU80 from DIMO",
        "Groups with vested interests, sabotaging renewable energy projects?",
        "Government targets to complete 162 mega development projects by 2026"
      ],
      "summary_for_llm": "DIMO, a leading diversified conglomerate in Sri Lanka and the authorized distributor for KALMAR equipment in the country, recently delivered the state-of-the-art KALMAR DCU80 Empty Container Handler (ECH) to IWS Logistics (Private) Limited, one of Sri Lanka’s premier private container depot operators. This delivery reflects DIMO’s expanding presence in the country’s container handling and logistics industry. Boasting an 8-ton lifting capacity, the newly delivered KALMAR DCU80 Empty Container Handler is specifically engineered to handle empty containers in container yards, enhancing yard management and operational efficiency. The DCU80, designed to improve space management, maximizes depot capacity and can handle a six-high stack of General Purpose (GP) containers. With its quick lifting capabilities and lowering cycles, the DCU80 dramatically increases output, boosts depot throughput, and shortens Prime Movers’ turnaround times. Compared to traditional empty container handler, its new Smart Hydraulics with Load Sensing technology reduces fuel consumption and maintenance costs by supplying hydraulic power only when needed. Crucially, this also helps to reduce CO₂ emissions in the yard, providing container operators with an economical and environmentally friendly option. The DCU80, which was built using strong Scandinavian engineering principles, ensures reliable performance and endurance even in the harsh and demanding tropical climates, guaranteeing 24/7 operational capability. Its ergonomic and operator-centric design also encourages higher operating efficiency, increased predictability, and ease of use. Speaking of this milestone, Mr. Dimitri Sheriff, Director – Corporate Affairs of IWS Holdings Pvt Ltd, stated, “IWS has trusted the KALMAR brand for decades. Partnering with DIMO as the local agent for KALMAR gives us peace of mind—combining world-class equipment with excellent customer service, engineering expertise, and after-sales support. We are confident that the KALMAR DCU80 Empty Container Handler will greatly improve our yard operations and provide our customers with more value. This enables us to provide reliable, outstanding service for our clients.” Commenting on the broader industry trends, Mr. Chaminda Ranawana, Executive Director of DIMO, who leads the Material Handling business in the group, said, “Today, many container operators are looking for environmentally friendly ways to increase operational effectiveness. The DCU80 is an excellent example of equipment that KALMAR develops with a strong emphasis on sustainability. Compared to previous models or other manufacturers, it offers a notable reduction in fuel consumption due to its intelligent hydraulic systems and efficient powertrain. It is a great privilege for DIMO to support the goals of Sri Lanka’s rapidly expanding logistics industry by bringing cutting-edge solutions that promote operational excellence and sustainability.” DIMO’s partnership with top brands like KALMAR highlights the company’s dedication to improving Sri Lanka’s logistics infrastructure and fostering a more efficient, greener future, while bringing the greatest technology from around the world to the country. END Photo Caption : Senior management representatives of DIMO and IWS, together with other officials, at the handing-over ceremony of the KALMAR DCU80 Empty Container Handler. About DIMO DIMO is a leading diversified conglomerate in Sri Lanka. With its corporate purpose of fuelling dreams and aspirations of the communities it serves, DIMO is committed to creating value responsibly by building partnerships that last generations. Since its inception over eight decades ago, the company has been driven by perfect partnerships, having diversified into wide spectrums of sectors including Agriculture, Building Services, Construction, Education, Healthcare, Home & Garden, Industrial Solutions, Mobility, Power & Energy and Water & Fluid management. DIMO provides world-class solutions and represents the best-engineered brands in the world while adding value and convenience to the lifestyles of consumers in a responsible and ethical manner.",
      "temporal_velocity_score": 0.45
    },
    {
      "cluster_id": 2,
      "detected_category": "Transportation & Logistics",
      "article_count": 12,
      "key_headlines": [
        "Orient Finance Supports Sri Lanka’s Three-Wheel Drivers with New Tuk Leasing Plan",
        "Nissan launches The Arc business plan to drive value and enhance competitiveness and profitability",
        "HNB Reinforces Commitment as Platinum Sponsor & Official Banking Partner at 1st ever IBSL National Banking and Finance Conference 2025"
      ],
      "summary_for_llm": "Three-wheelers, or tuk-tuks, are a vital part of Sri Lanka’s transport landscape, providing millions with affordable and efficient mobility each day. Behind the wheel of each tuk-tuk is a dedicated driver—someone who works tirelessly to support their family, often under challenging financial circumstances. As the nation continues to navigate economic difficulties, these drivers are under increasing pressure. Yet, their resilience and commitment remain unwavering. Beyond their role in transportation, three-wheeler drivers often serve as first responders in emergencies—rushing the injured to hospitals, helping stranded motorists, or offering rides late at night when no other options are available. Their contribution to society is significant, though frequently overlooked. In recognition of these everyday heroes, Orient Finance PLC has launched a heartfelt campaign that brings to life the real story of a three-wheeler driver. The campaign follows a day in his life, shedding light on the hard work, perseverance, and sense of responsibility that defines their profession. It aims to raise awareness of the struggles they endure while celebrating the vital role they play within their communities. This initiative is more than just a commercial—it is a tribute to the three-wheeler community. Through this campaign, Orient Finance reaffirms its commitment to supporting these drivers, not only through words but with meaningful financial solutions designed specifically for their needs. Speaking about the campaign, K.M.M. Jabir, Executive Director and CEO of Orient Finance PLC, said, “These individuals are the backbone of our local transport network. They operate under trying conditions to deliver an essential service that many rely on—whether for commuting, emergencies, or day-to-day mobility. At Orient Finance, we deeply value their contribution. Our role extends beyond financial services; we are here to uplift their lives. The First Month’s Rental Waiver is just one of many steps we are taking to offer real, impactful support.” At the heart of this initiative is the Orient Tuk Leasing plan, carefully crafted to meet the unique financial challenges faced by three-wheeler drivers. The plan offers a one-month grace period before the first rental payment, providing much-needed breathing space to manage household expenses, vehicle repairs, and maintenance. With low monthly installments and the option to borrow a higher amount, it helps ease the strain of ongoing costs. In addition, the approval process is quick and straightforward, ensuring drivers receive timely support without unnecessary delays. The plan also includes a Life Insurance Scheme, which provides Rs. 500,000 in support to a driver’s family in the event of an untimely death. Already, more than ten families have benefitted from this safety net, reflecting the tangible impact of the initiative. For those seeking Sharia-compliant financial solutions, Orient Finance also offers Ijarah Tuk Leasing, reinforcing its commitment to inclusive and accessible services for all communities. Recognising that many drivers invest their life savings into down payments—often leaving little to cover immediate needs—Orient Finance’s approach provides both short-term relief and long-term financial stability. The company’s goal is to empower drivers to focus on what truly matters: their livelihoods, their loved ones, and their future. With this campaign and the enhanced leasing offering, Orient Finance PLC continues to stand with Sri Lanka’s three-wheeler drivers—not just as a financial institution, but as a true partner that listens, understands, and acts. Ends. About Orient Finance PLC Orient Finance offers a comprehensive suite of financial services tailored to meet the specific needs of customers, including Fixed Deposits, Savings Accounts, Leasing, Gold Loans, Alternative Finance Solutions, Corporate Financing, and more. With over 43 years of industry experience, the company has earned a reputation for stability, reliability, and customer-centric solutions. A proud member of the Janashakthi Group, Orient Finance PLC is licensed by the Central Bank of Sri Lanka and holds a BB+ (Positive Outlook) rating from Lanka Rating Agency.",
      "temporal_velocity_score": 0.18
    },
    {
      "cluster_id": 0,
      "detected_category": "General Business News",
      "article_count": 15,
      "key_headlines": [
        "Bally’s Colombo marks 30 years, solidifies reputation as a ‘vibrant leisure hub’",
        "ComBank advances agri-modernisation efforts to boost paddy yields in Polonnaruwa",
        "Lungi puts Sri Lankan flavours on the global map with back-to-back Michelin honours"
      ],
      "summary_for_llm": "Bally’s Colombo, Sri Lanka’s leading entertainment destination, celebrated its 30th anniversary on October 26, commemorating three decades of shaping the nation’s tourism and nightlife. The landmark event was graced by Bollywood icon Bipasha Basu, highlighting the venue’s international appeal. Since its establishment in 1995, Bally’s has been instrumental in positioning Colombo on the global entertainment map, attracting nearly a thousand guests daily with its world-class gaming, live entertainment, and gourmet dining. A significant economic contributor, Bally’s supports a workforce of over a thousand employees and sustains a broad network of local suppliers. Its success in drawing international tourists has solidified Colombo’s reputation as a vibrant leisure hub. As it enters its next chapter, Bally’s Colombo reaffirms its commitment to innovation, superior guest experiences, and responsible practices. Image Caption: The landmark event was graced by Bollywood icon Bipasha Basu Source : The Island",
      "temporal_velocity_score": -0.03
    },
    {
      "cluster_id": 6,
      "detected_category": "General Business News",
      "article_count": 10,
      "key_headlines": [
        "DIMO Strengthens Vocational Education with New State-of-the-Art DATS Facility in Peliyagoda",
        "BSides Sri Lanka 2025 Celebrates a Breakthrough Cybersecurity Gathering in Colombo",
        "Swisstek Strengthens Community Impact with Vidyartha Rugby Development Camp at Mahiyanganaya"
      ],
      "summary_for_llm": "DIMO, one of Sri Lanka’s leading diversified conglomerates, is proud to announce the relocation of its new DIMO Academy for Technical Skills (DATS) facility in Peliyagoda. This marks a transformative step in the company’s ongoing commitment to enhancing vocational education and fostering globally competitive technical professionals in Sri Lanka. The new facility reflects DATS’ legacy of over 35 years in pioneering technical education that bridges the gap between industry demands and training excellence. From automobile mechatronics to plant engineering, DATS has developed industry-ready talent, securing global job placements for its graduates. The relocation to Peliyagoda strategically increases training capacity while introducing future-forward programs tailored to emerging industry trends. The relocation to Peliyagoda represents not just a physical shift but also a deep commitment to elevating vocational education to global standards. Completing German-accredited programs at DATS unlocks unparalleled access to international employment, particularly in Germany. Renowned German companies such as HomeServe Germany and MAN have partnered with DATS to assure guaranteed job placements for graduates, paving the way to secure rewarding careers abroad. Through these initiatives, DATS has transformed the lives of countless young individuals, enabling them to reach heights they had never imagined. Dilrukshi Kurukulasuriya, Executive Director/CHRO of DIMO and Director in Charge of the Group’s Education Sector, shared her perspective on this milestone: “Promoting vocational training is one of the most meaningful ways to drive economic development in Sri Lanka. By building demand-based skills, we can bridge the gap between potential and opportunity. Vocational education should not be viewed as a second choice. Instead, it should be an integral part of a more inclusive education system, empowering Sri Lankan youth to achieve their fullest potential.” Peliyagoda’s central location enhances accessibility for students nationwide while fostering collaboration with industry stakeholders. The purpose-built facility adheres to strict international standards, aligning with globally endorsed TVET principles, including those advocated by the German Chamber of Commerce. This ensures that the curriculum, infrastructure, and training methodologies meet world-class benchmarks. The cutting-edge facility features advanced laboratories equipped with modern diagnostic tools, mechatronic technologies, and control systems. High-tech workshops blend traditional practices with innovative approaches, such as electric and hybrid vehicle systems. Additionally, dynamic smart classrooms, simulation areas replicating industrial environments, and digital libraries create an immersive learning experience. Dedicated student resource centers further support academic and career development. This new phase enables DATS to introduce several specialized programs addressing high-demand areas, such as industrial automation, electric vehicle technology, and building services. This includes short-term upskilling initiatives, corporate training programs, and a specialized LPG Technician Training Program aimed at meeting energy sector requirements. Moreover, vocational education consulting services developed in collaboration with international institutions aim to enrich curriculum design and adopt global best practices. Looking ahead, DIMO envisions positioning the DATS as Sri Lanka’s Centre of Excellence for Dual Vocational Training, with plans to expand enrolment and training capacity. The facility will also serve as a national hub for green technologies and sustainable engineering. Future initiatives include forging international partnerships, offering globally recognized certifications, and introducing student exchange programs to enhance mobility opportunities. END About DIMO DIMO is a leading diversified conglomerate in Sri Lanka. With its corporate purpose of fuelling dreams and aspirations of the communities it serves, DIMO is committed to creating value responsibly by building partnerships that last generations. Since its inception over eight decades ago, the company has been driven by perfect partnerships, having diversified into wide spectrums of sectors including Agriculture, Building Services, Construction, Education, Healthcare, Home & Garden, Industrial Solutions, Mobility, Power & Energy and Water & Fluid management. DIMO provides world-class solutions and represents the best-engineered brands in the world while adding value and convenience to the lifestyles of consumers in a responsible and ethical manner.",
      "temporal_velocity_score": 0.18
    },
    {
      "cluster_id": 4,
      "detected_category": "Economic & Financial Context",
      "article_count": 2,
      "key_headlines": [
        "Link Natural’s Swastha Amurtha Now Available on Costco Japan’s Online Platform",
        "Velona Cuddles Bamboo Nappies Set to Revolutionize Baby Care in Australia"
      ],
      "summary_for_llm": "Link Natural Products, a pioneer in herbal health care industry, is proud to announce that its flagship herbal drink, Swastha Amurtha, is now available on Costco Online in Japan. This significant milestone marks a major expansion of the brand’s global presence. Swastha Amurtha, a 100% natural herbal drink, is formulated with Nelli and Rasakinda. The combination of Nelli and Rasakinda has been popularly used in Ayurveda to detoxify the body, boost immunity and enhance overall well-being. Traditionally in Sri Lanka, people used to boil Nelli and Rasakinda together and drink it as these ingredients are well known for its effects on purifying blood, detoxifying the body internally and enhancing the overall well-being. The listing of Swastha Amurtha on Costco Online in Japan is a testament to the product’s quality and efficacy. Japanese consumers, known for their high-quality standards and appreciation of natural health products, now have convenient access to this herbal wellness drink. Costco, one of the world’s leading wholesale retailers, provides a platform for Link Natural to reach a broader audience in Japan, further strengthening the brand’s global footprint. Link Natural Products have achieved remarkable success in the Japanese market through its flagship brand Link Samahan, which is available in mainstream retailers such as Costco, Kaldi, Aeon Cafferant, Seijo ishii, and Jupiter Coffee shop. Swastha Amurtha is also now available for purchase in Japan through the Costco Online platform. To date, Link Natural continues to expand its portfolio and reach, bringing the benefits of Ayurveda and traditional remedies to consumers around the world. The company invites all consumers to explore the wellness benefits of Swastha Amurtha, and its extensive range of holistic wellness products. Photo Caption Japanese consumers enjoying the wellness drink Swastha Amurtha",
      "temporal_velocity_score": 0.08
    },
    {
      "cluster_id": 5,
      "detected_category": "Exporting & Trade Access",
      "article_count": 8,
      "key_headlines": [
        "Colombo Bourse falls as uncertainty mounts",
        "Sri Lanka’s digital payment market to nearly hit $10B mark this year",
        "Gold price tops $2,300, shattering all-time high"
      ],
      "summary_for_llm": "The Colombo bourse extended the bearish momentum for the second consecutive day with the All Share Price Index (ASPI) closing at 12,359 losing 140 points. “This decline was particularly influenced by the selling pressure observed on the Banking sector counters like COMB and HNB, as well as index heavyweights such as JKH and LOLC,” First Capital Research said. Furthermore, there was notable buying interest in CTC and Chevron Lubricants, driven by the recently disclosed earnings reports indicating a substantial upsurge in both revenue and earnings. Meanwhile, the turnover witnessed a significant increase during the day, totaling Rs.3.3Bn making a 32.7% increase from the monthly average of Rs.2.5Bn. This uptick was attributed to active participation from both retail investors and High net worth investors. The Capital Goods sector led turnover at 39%, followed by the Banking and Food, Beverage, and Tobacco sectors jointly contributing to 31% of overall turnover. Additionally, interest in the Construction sector was also observed. Foreign investors remained net sellers, recording a net outflow of Rs.587.8Mn.",
      "temporal_velocity_score": 0.3
    },
    {
      "cluster_id": 3,
      "detected_category": "Economic & Financial Context",
      "article_count": 15,
      "key_headlines": [
        "Ceylon Chamber Welcomes National Digital Economy Strategy",
        "IMF ready to support Sri Lanka’s discussions with bondholders",
        "IMF Reaches Staff-Level Agreement on the Second Review of Sri Lanka’s Extended Fund Facility"
      ],
      "summary_for_llm": "The Ceylon Chamber recognizes the Digital Economy as a key enabler for Sri Lanka’s economic growth acceleration. The National Digital Economy Strategy 2030 recently published by the Ministry of Technology provides a roadmap to unlock the benefits of the digital economy. The strategy focuses on the improvement of the digital infrastructure, implementation of the Digital ID, improving cybersecurity legislation, connected digital government, and enhancing digital skills for government and industry. These policy areas have been advocated by the Chamber in the past most notably on the swift implementation of the Digital ID. The Chamber was involved in the consultation process for the drafting of the strategy with representation in the High-Level Officers Committee coordinated by the Secretary to the Prime Minister and provided further input and guidance through the Digital Economy Committee of the Chamber. With the strategy document now open for public and stakeholder review, it is an ideal opportunity for further engagement to strengthen the strategy and plan of action. As with most strategies, the important aspect is the implementation of the policy. The strategy document outlines the institutional framework for implementation and  proposed an action plan. It is vital that is implemented with ownership from the government and collaboration with industry stakeholders.",
      "temporal_velocity_score": -0.0
    }
  ]