{"_default": {"1": {"source": "SundayTimes", "section": "business-times", "title": "Devastation", "url": "https://www.sundaytimes.lk/251130/business-times/devastation-622273.html", "text": "Rice fields destroyed by incessant rain and floods at Manampitiya, Gallalla in the Northcentral Province.                                                                    Pic by Nimal Jayarathna  Rice fields destroyed by incessant rain and floods at Manampitiya, Gallalla in the Northcentral Province.                                                                    Pic by Nimal Jayarathna  Send Email to Friend Hitad.lk has you covered with quality used or brand new cars for sale that are   budget friendly yet reliable! Now is the time to sell your old ride for something   more attractive to today's modern automotive market demands. Browse through   our selection of affordable options now on Hitad.lk before deciding on what will   work best for you! Print Edition – The Sunday Times, Sri Lanka ", "scraped_at": "2025-12-08T21:23:51.619215"}, "2": {"source": "SundayTimes", "section": "business-times", "title": "Weather crisis: Some tourists to postpone trips to Sri Lanka", "url": "https://www.sundaytimes.lk/251130/business-times/weather-crisis-some-tourists-to-postpone-trips-to-sri-lanka-622271.html", "text": "By Sunimalee Dias Sri Lanka’s tourism industry has taken charge of ensuring the safety of tourists and is adhering to necessary precautions required and requested most arrivals to be postponed in the wake of the cyclonic storm Ditwah that hit the country on Thursday. While southern resorts have been largely unaffected by the crisis, the [...] By Sunimalee Dias Sri Lanka’s tourism industry has taken charge of ensuring the safety of tourists and is adhering to necessary precautions required and requested most arrivals to be postponed in the wake of the cyclonic storm Ditwah that hit the country on Thursday. While southern resorts have been largely unaffected by the crisis, the problem areas are the hill country and the Northcentral Province. All tourist sites have been closed since Thursday while some travellers are considering postponing their visit plans. Some resort properties in Nuwara Eliya had been damaged while the rooms of a hotel in Kandy had been flooded forcing about 35 guests to be shifted to the bar area. At the moment tourist arrivals are being postponed without any further notice since accessibility to hotels (particularly to the hill country) have been blocked as roads are flooded, Nuwara Eliya Hotels Association former President Shaam Weerasooriya has said. But these postponements will not be subjected to any charges. Meanwhile, travellers already in the country on tour or just arrived have been taken to safe hotels and transit hotels. Mr. Weerasooriya said some travellers have been placed in hotels somewhere closer to Colombo like the transit hotels as these places are functioning well especially the city hotels. Transportation is also provided to these locations in which areas the roads are accessible. Some tourists have also been placed in hotels in Kandy that are currently full due to their inability to go further to hotels like in Nuwara Eliya. Hotels in Nuwara Eliya have been in touch with travel agents and tour guides to establish communication with their guests and ensure their safety while touring or visiting the country, Mr. Weerasooriya said. He noted that the hotels are very safe and that the transportation systems are safe as well and a system to protect travelers when moving from one place to another. The Tourist Police has also been located in almost all police stations in areas where travelers are lodging to ensure their safety. Sri Lanka Association of Inbound Tour Operators President Nalin Jayasundere said that they are ensuring the safety of all travellers and not taking any risks since certain roads are not passable. However, he noted there are no cancellations at present. Sri Lanka is reportedly facing the worst climatic conditions with incessant rains and strong winds resulting in 56 deaths, 14 injured and 21 displaced as at 9 am on Friday according to the Disaster Management Centre. This stormy weather named Ditwa has impacted 20 districts in the country. So far the main rivers have overflowed causing a flood situation in most areas and as a result of the heavy rains earth slips and landslides have been reported from a number of hilly areas due to which roads and railway lines have hampered travel to and from a number of districts. The crisis comes just as Sri Lanka is targeting 2.3-2.5 million tourists in 2025. Send Email to Friend Hitad.lk has you covered with quality used or brand new cars for sale that are   budget friendly yet reliable! Now is the time to sell your old ride for something   more attractive to today's modern automotive market demands. Browse through   our selection of affordable options now on Hitad.lk before deciding on what will   work best for you! Print Edition – The Sunday Times, Sri Lanka ", "scraped_at": "2025-12-08T21:23:52.581236"}, "3": {"source": "SundayTimes", "section": "business-times", "title": "Small housing banks’ merger tests SL’s financial stability", "url": "https://www.sundaytimes.lk/251130/business-times/small-housing-banks-merger-tests-sls-financial-stability-622269.html", "text": "By Bandula Sirimanna Sri Lanka’s long-troubled state housing finance sector is set for its most consequential restructuring in decades, following the government’s decision to merge the Housing Development Finance Corporation (HDFC) and the State Mortgage and Investment Bank (SMIB) with two of the country’s largest state-owned commercial banks. The move, approved by Cabinet in November [...] By Bandula Sirimanna Sri Lanka’s long-troubled state housing finance sector is set for its most consequential restructuring in decades, following the government’s decision to merge the Housing Development Finance Corporation (HDFC) and the State Mortgage and Investment Bank (SMIB) with two of the country’s largest state-owned commercial banks. The move, approved by Cabinet in November 11, comes after the Central Bank flagged serious concerns about the long-term survival of both institutions. Central Bank Governor Dr. Nandalal Weerasinghe did not mince words this week when he described the two specialised lenders as “burdened with unsustainable business models, poor profitability and an inability to meet minimum capital requirements”. Speaking at a media briefing, he said the regulator had drawn up a “targeted consolidation plan” focusing on smaller banks to safeguard financial sector stability and protect depositors. According to the plan, the government’s entire shareholding in HDFC incorporated under the Housing Development Finance Corporation Act of 1997 will be transferred to Bank of Ceylon (BOC), which will operate HDFC as its subsidiary.  The State Mortgage and Investment Bank, established in 1975, will become a subsidiary of People’s Bank (PB) under a similar transfer of state-owned shares. Dr. Weerasinghe highlighted that both HDFC and SMIB had “low risk densities due to their heavy reliance on Employees’ Provident Fund (EPF)-backed loans”, which carry zero risk-weighting but also reflect the narrowness of their loan books. Credit rating agency Fitch Ratings, in its latest review, supported this view, noting that the proposed transfers are unlikely to affect the ratings of BOC or PB. Several financial and banking analysts fear that once absorbed into larger banks, low-income housing borrowers traditionally served by these institutions could be de-prioritised in favour of more commercially attractive segments. Send Email to Friend Hitad.lk has you covered with quality used or brand new cars for sale that are   budget friendly yet reliable! Now is the time to sell your old ride for something   more attractive to today's modern automotive market demands. Browse through   our selection of affordable options now on Hitad.lk before deciding on what will   work best for you! Print Edition – The Sunday Times, Sri Lanka ", "scraped_at": "2025-12-08T21:23:54.056922"}, "4": {"source": "SundayTimes", "section": "business-times", "title": "ACL cables bullish on growth in SL/abroad", "url": "https://www.sundaytimes.lk/251130/business-times/acl-cables-bullish-on-growth-in-slabroad-622267.html", "text": "By Duruthu Edirimuni Chandrasekera ACL Cables PLC is bullish on growth opportunities both in the country as well as abroad, officials said. “We are quite open to investments in different verticals and acquiring companies as long as they fit in with our organisational structure and broader investment strategies,” one official said. He also said that [...] By Duruthu Edirimuni Chandrasekera ACL Cables PLC is bullish on growth opportunities both in the country as well as abroad, officials said. “We are quite open to investments in different verticals and acquiring companies as long as they fit in with our organisational structure and broader investment strategies,” one official said. He also said that with the construction sector rebounding, the company has strong plans to capitalise on growth areas. In this backdrop, ACL cables will be introducing new products next year, he added. ACL Cables PLC introduced the ACL SAX Medium Voltage Covered Conductor (MVCC) System at Techno 2025, targeting improvements in Sri Lanka’s power distribution by offering a reliable and cost-effective solution, he said, highlighting the launch of new products by the company. “This system is engineered to resolve fault chain issues that plague traditional bare conductor systems, thereby enhancing operational efficiency for utilities.” He said that in the coming year, the company is looking at launching more innovative products as well as exporting them to new regions. ACL Cables is already exported to regional countries, Africa, Southeast Asia, etc. He said that with the digital economy transformation intended for the country, ACL Cables will also join in terms of supplying state-of-the-art products needed for setting up different entities and centres. Send Email to Friend Hitad.lk has you covered with quality used or brand new cars for sale that are   budget friendly yet reliable! Now is the time to sell your old ride for something   more attractive to today's modern automotive market demands. Browse through   our selection of affordable options now on Hitad.lk before deciding on what will   work best for you! Print Edition – The Sunday Times, Sri Lanka ", "scraped_at": "2025-12-08T21:23:56.460048"}}}